Resources/schemas/Wsdl/New_Zealand_Inland_Revenue_Reporting_for_Payroll_Version_2 - Employement  end-point URL.wsdl

<wsdl:definitions xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/" xmlns:wsx="http://schemas.xmlsoap.org/ws/2004/09/mex" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" xmlns:wsa10="http://www.w3.org/2005/08/addressing" xmlns:wsp="http://www.w3.org/ns/ws-policy" xmlns:wsap="http://schemas.xmlsoap.org/ws/2004/08/addressing/policy" xmlns:msc="http://schemas.microsoft.com/ws/2005/12/wsdl/contract" xmlns:soap12="http://schemas.xmlsoap.org/wsdl/soap12/" xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/08/addressing" xmlns:wsam="http://www.w3.org/2007/05/addressing/metadata" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:tns="https://services.ird.govt.nz/GWS/Employment/v2/" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:wsaw="http://www.w3.org/2006/05/addressing/wsdl" xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/" name="Employment" targetNamespace="https://services.ird.govt.nz/GWS/Employment/v2/">
<wsp:Policy wsu:Id="WSHttpBinding_Employment_policy">
<wsp:ExactlyOne>
<wsp:All>
<sp:TransportBinding xmlns:sp="http://schemas.xmlsoap.org/ws/2005/07/securitypolicy">
<wsp:Policy>
<sp:TransportToken>
<wsp:Policy>
<sp:HttpsToken RequireClientCertificate="false"/>
</wsp:Policy>
</sp:TransportToken>
<sp:AlgorithmSuite>
<wsp:Policy>
<sp:Basic256/>
</wsp:Policy>
</sp:AlgorithmSuite>
<sp:Layout>
<wsp:Policy>
<sp:Strict/>
</wsp:Policy>
</sp:Layout>
</wsp:Policy>
</sp:TransportBinding>
<wsam:Addressing>
<wsp:Policy>
<wsam:AnonymousResponses/>
</wsp:Policy>
</wsam:Addressing>
</wsp:All>
</wsp:ExactlyOne>
</wsp:Policy>
<wsdl:types>
<xsd:schema elementFormDefault="qualified" targetNamespace="https://services.ird.govt.nz/GWS/Employment/v2/">
<xsd:element name="Create">
<xsd:complexType>
<xsd:sequence>
<xsd:element xmlns:q1="https://services.ird.govt.nz/GWS/Employment/v2/:types/CreateRequest" minOccurs="1" name="CreateRequestMsg" nillable="true" type="q1:CreateRequestType"/>
</xsd:sequence>
</xsd:complexType>
</xsd:element>
<xsd:element name="CreateResponse">
<xsd:complexType>
<xsd:sequence>
<xsd:element xmlns:q2="https://services.ird.govt.nz/GWS/Employment/v2/:types/CreateResponse" minOccurs="0" name="CreateResult" nillable="true" type="q2:CreateResponseType"/>
</xsd:sequence>
</xsd:complexType>
</xsd:element>
<xsd:element name="Terminate">
<xsd:complexType>
<xsd:sequence>
<xsd:element xmlns:q3="https://services.ird.govt.nz/GWS/Employment/v2/:types/TerminateRequest" minOccurs="1" name="TerminateRequestMsg" nillable="true" type="q3:TerminateRequestType"/>
</xsd:sequence>
</xsd:complexType>
</xsd:element>
<xsd:element name="TerminateResponse">
<xsd:complexType>
<xsd:sequence>
<xsd:element xmlns:q4="https://services.ird.govt.nz/GWS/Employment/v2/:types/TerminateResponse" minOccurs="0" name="TerminateResult" nillable="true" type="q4:TerminateResponseType"/>
</xsd:sequence>
</xsd:complexType>
</xsd:element>
<xsd:element name="Update">
<xsd:complexType>
<xsd:sequence>
<xsd:element xmlns:q5="https://services.ird.govt.nz/GWS/Employment/v2/:types/UpdateRequest" minOccurs="1" name="UpdateRequestMsg" nillable="true" type="q5:UpdateRequestType"/>
</xsd:sequence>
</xsd:complexType>
</xsd:element>
<xsd:element name="UpdateResponse">
<xsd:complexType>
<xsd:sequence>
<xsd:element xmlns:q6="https://services.ird.govt.nz/GWS/Employment/v2/:types/UpdateResponse" minOccurs="0" name="UpdateResult" nillable="true" type="q6:UpdateResponseType"/>
</xsd:sequence>
</xsd:complexType>
</xsd:element>
<xsd:element name="RetrieveList">
<xsd:complexType>
<xsd:sequence>
<xsd:element xmlns:q7="https://services.ird.govt.nz/GWS/Employment/v2/:types/RetrieveListRequest" minOccurs="1" name="RetrieveListRequestMsg" nillable="true" type="q7:RetrieveListRequestType"/>
</xsd:sequence>
</xsd:complexType>
</xsd:element>
<xsd:element name="RetrieveListResponse">
<xsd:complexType>
<xsd:sequence>
<xsd:element xmlns:q8="https://services.ird.govt.nz/GWS/Employment/v2/:types/RetrieveListResponse" minOccurs="0" name="RetrieveListResult" nillable="true" type="q8:RetrieveListResponseType"/>
</xsd:sequence>
</xsd:complexType>
</xsd:element>
</xsd:schema>
<xsd:schema xmlns:tns="https://services.ird.govt.nz/GWS/Employment/v2/:types/CreateRequest" elementFormDefault="qualified" targetNamespace="https://services.ird.govt.nz/GWS/Employment/v2/:types/CreateRequest">
<xsd:complexType name="CreateRequestType">
<xsd:sequence>
<xsd:element name="CreateRequestWrapper" nillable="true">
<xsd:complexType>
<xsd:sequence>
<xsd:any minOccurs="0" processContents="lax"/>
</xsd:sequence>
</xsd:complexType>
</xsd:element>
</xsd:sequence>
</xsd:complexType>
<xsd:element name="CreateRequestType" nillable="true" type="tns:CreateRequestType"/>
</xsd:schema>
<xsd:schema xmlns:tns="https://services.ird.govt.nz/GWS/Employment/v2/:types/CreateResponse" elementFormDefault="qualified" targetNamespace="https://services.ird.govt.nz/GWS/Employment/v2/:types/CreateResponse">
<xsd:complexType name="CreateResponseType">
<xsd:sequence>
<xsd:element name="CreateResponseWrapper" nillable="true">
<xsd:complexType>
<xsd:sequence>
<xsd:any minOccurs="0" processContents="lax"/>
</xsd:sequence>
</xsd:complexType>
</xsd:element>
</xsd:sequence>
</xsd:complexType>
<xsd:element name="CreateResponseType" nillable="true" type="tns:CreateResponseType"/>
</xsd:schema>
<xsd:schema xmlns:tns="https://services.ird.govt.nz/GWS/Employment/v2/:types/TerminateRequest" elementFormDefault="qualified" targetNamespace="https://services.ird.govt.nz/GWS/Employment/v2/:types/TerminateRequest">
<xsd:complexType name="TerminateRequestType">
<xsd:sequence>
<xsd:element name="TerminateRequestWrapper" nillable="true">
<xsd:complexType>
<xsd:sequence>
<xsd:any minOccurs="0" processContents="lax"/>
</xsd:sequence>
</xsd:complexType>
</xsd:element>
</xsd:sequence>
</xsd:complexType>
<xsd:element name="TerminateRequestType" nillable="true" type="tns:TerminateRequestType"/>
</xsd:schema>
<xsd:schema xmlns:tns="https://services.ird.govt.nz/GWS/Employment/v2/:types/TerminateResponse" elementFormDefault="qualified" targetNamespace="https://services.ird.govt.nz/GWS/Employment/v2/:types/TerminateResponse">
<xsd:complexType name="TerminateResponseType">
<xsd:sequence>
<xsd:element name="TerminateResponseWrapper" nillable="true">
<xsd:complexType>
<xsd:sequence>
<xsd:any minOccurs="0" processContents="lax"/>
</xsd:sequence>
</xsd:complexType>
</xsd:element>
</xsd:sequence>
</xsd:complexType>
<xsd:element name="TerminateResponseType" nillable="true" type="tns:TerminateResponseType"/>
</xsd:schema>
<xsd:schema xmlns:tns="https://services.ird.govt.nz/GWS/Employment/v2/:types/UpdateRequest" elementFormDefault="qualified" targetNamespace="https://services.ird.govt.nz/GWS/Employment/v2/:types/UpdateRequest">
<xsd:complexType name="UpdateRequestType">
<xsd:sequence>
<xsd:element name="UpdateRequestWrapper" nillable="true">
<xsd:complexType>
<xsd:sequence>
<xsd:any minOccurs="0" processContents="lax"/>
</xsd:sequence>
</xsd:complexType>
</xsd:element>
</xsd:sequence>
</xsd:complexType>
<xsd:element name="UpdateRequestType" nillable="true" type="tns:UpdateRequestType"/>
</xsd:schema>
<xsd:schema xmlns:tns="https://services.ird.govt.nz/GWS/Employment/v2/:types/UpdateResponse" elementFormDefault="qualified" targetNamespace="https://services.ird.govt.nz/GWS/Employment/v2/:types/UpdateResponse">
<xsd:complexType name="UpdateResponseType">
<xsd:sequence>
<xsd:element name="UpdateResponseWrapper" nillable="true">
<xsd:complexType>
<xsd:sequence>
<xsd:any minOccurs="0" processContents="lax"/>
</xsd:sequence>
</xsd:complexType>
</xsd:element>
</xsd:sequence>
</xsd:complexType>
<xsd:element name="UpdateResponseType" nillable="true" type="tns:UpdateResponseType"/>
</xsd:schema>
<xsd:schema xmlns:tns="https://services.ird.govt.nz/GWS/Employment/v2/:types/RetrieveListRequest" elementFormDefault="qualified" targetNamespace="https://services.ird.govt.nz/GWS/Employment/v2/:types/RetrieveListRequest">
<xsd:complexType name="RetrieveListRequestType">
<xsd:sequence>
<xsd:element name="RetrieveListRequestWrapper" nillable="true">
<xsd:complexType>
<xsd:sequence>
<xsd:any minOccurs="0" processContents="lax"/>
</xsd:sequence>
</xsd:complexType>
</xsd:element>
</xsd:sequence>
</xsd:complexType>
<xsd:element name="RetrieveListRequestType" nillable="true" type="tns:RetrieveListRequestType"/>
</xsd:schema>
<xsd:schema xmlns:tns="https://services.ird.govt.nz/GWS/Employment/v2/:types/RetrieveListResponse" elementFormDefault="qualified" targetNamespace="https://services.ird.govt.nz/GWS/Employment/v2/:types/RetrieveListResponse">
<xsd:complexType name="RetrieveListResponseType">
<xsd:sequence>
<xsd:element name="RetrieveListResponseWrapper" nillable="true">
<xsd:complexType>
<xsd:sequence>
<xsd:any minOccurs="0" processContents="lax"/>
</xsd:sequence>
</xsd:complexType>
</xsd:element>
</xsd:sequence>
</xsd:complexType>
<xsd:element name="RetrieveListResponseType" nillable="true" type="tns:RetrieveListResponseType"/>
</xsd:schema>
<xs:schema xmlns:xs="http://www.w3.org/2001/XMLSchema" xmlns:tns="http://schemas.microsoft.com/2003/10/Serialization/" attributeFormDefault="qualified" elementFormDefault="qualified" targetNamespace="http://schemas.microsoft.com/2003/10/Serialization/">
<xs:element name="anyType" nillable="true" type="xs:anyType"/>
<xs:element name="anyURI" nillable="true" type="xs:anyURI"/>
<xs:element name="base64Binary" nillable="true" type="xs:base64Binary"/>
<xs:element name="boolean" nillable="true" type="xs:boolean"/>
<xs:element name="byte" nillable="true" type="xs:byte"/>
<xs:element name="dateTime" nillable="true" type="xs:dateTime"/>
<xs:element name="decimal" nillable="true" type="xs:decimal"/>
<xs:element name="double" nillable="true" type="xs:double"/>
<xs:element name="float" nillable="true" type="xs:float"/>
<xs:element name="int" nillable="true" type="xs:int"/>
<xs:element name="long" nillable="true" type="xs:long"/>
<xs:element name="QName" nillable="true" type="xs:QName"/>
<xs:element name="short" nillable="true" type="xs:short"/>
<xs:element name="string" nillable="true" type="xs:string"/>
<xs:element name="unsignedByte" nillable="true" type="xs:unsignedByte"/>
<xs:element name="unsignedInt" nillable="true" type="xs:unsignedInt"/>
<xs:element name="unsignedLong" nillable="true" type="xs:unsignedLong"/>
<xs:element name="unsignedShort" nillable="true" type="xs:unsignedShort"/>
<xs:element name="char" nillable="true" type="tns:char"/>
<xs:simpleType name="char">
<xs:restriction base="xs:int"/>
</xs:simpleType>
<xs:element name="duration" nillable="true" type="tns:duration"/>
<xs:simpleType name="duration">
<xs:restriction base="xs:duration">
<xs:pattern value="\-?P(\d*D)?(T(\d*H)?(\d*M)?(\d*(\.\d*)?S)?)?"/>
<xs:minInclusive value="-P10675199DT2H48M5.4775808S"/>
<xs:maxInclusive value="P10675199DT2H48M5.4775807S"/>
</xs:restriction>
</xs:simpleType>
<xs:element name="guid" nillable="true" type="tns:guid"/>
<xs:simpleType name="guid">
<xs:restriction base="xs:string">
<xs:pattern value="[\da-fA-F]{8}-[\da-fA-F]{4}-[\da-fA-F]{4}-[\da-fA-F]{4}-[\da-fA-F]{12}"/>
</xs:restriction>
</xs:simpleType>
<xs:attribute name="FactoryType" type="xs:QName"/>
<xs:attribute name="Id" type="xs:ID"/>
<xs:attribute name="Ref" type="xs:IDREF"/>
</xs:schema>
</wsdl:types>
<wsdl:message name="Employment_Create_InputMessage">
<wsdl:part name="parameters" element="tns:Create"/>
</wsdl:message>
<wsdl:message name="Employment_Create_OutputMessage">
<wsdl:part name="parameters" element="tns:CreateResponse"/>
</wsdl:message>
<wsdl:message name="Employment_Terminate_InputMessage">
<wsdl:part name="parameters" element="tns:Terminate"/>
</wsdl:message>
<wsdl:message name="Employment_Terminate_OutputMessage">
<wsdl:part name="parameters" element="tns:TerminateResponse"/>
</wsdl:message>
<wsdl:message name="Employment_Update_InputMessage">
<wsdl:part name="parameters" element="tns:Update"/>
</wsdl:message>
<wsdl:message name="Employment_Update_OutputMessage">
<wsdl:part name="parameters" element="tns:UpdateResponse"/>
</wsdl:message>
<wsdl:message name="Employment_RetrieveList_InputMessage">
<wsdl:part name="parameters" element="tns:RetrieveList"/>
</wsdl:message>
<wsdl:message name="Employment_RetrieveList_OutputMessage">
<wsdl:part name="parameters" element="tns:RetrieveListResponse"/>
</wsdl:message>
<wsdl:portType name="Employment">
<wsdl:documentation>The Employment V2 service can be utilised for a number of employer tasks. For information regarding the proper use of this service, schemas, formatting of request and response types please refer to the documentation provided during onboarding.</wsdl:documentation>
<wsdl:operation name="Create">
<wsdl:documentation>
<summary>For use of the Create operation please reference the Employment directory provided at https://github.com/InlandRevenue/Gateway-Services/</summary>
<returns>CreateResponse will contain a status and error message. See schema for more details.</returns>
<param name="CreateRequestMsg">CreateRequest allows the creation of employment. See Employment schema for more details.</param>
</wsdl:documentation>
<wsdl:input wsam:Action="https://services.ird.govt.nz/GWS/Employment/v2/Employment/Create" message="tns:Employment_Create_InputMessage"/>
<wsdl:output wsam:Action="https://services.ird.govt.nz/GWS/Employment/v2/Employment/CreateResponse" message="tns:Employment_Create_OutputMessage"/>
</wsdl:operation>
<wsdl:operation name="Terminate">
<wsdl:documentation>
<summary>For use of the Terminate operation please reference the Employment directory provided at https://github.com/InlandRevenue/Gateway-Services/</summary>
<returns>TerminateResponse will contain a status and error message. See schema for more details.</returns>
<param name="TerminateRequestMsg">TerminateRequest allows the termination of employment. See Employment schema for more details.</param>
</wsdl:documentation>
<wsdl:input wsam:Action="https://services.ird.govt.nz/GWS/Employment/v2/Employment/Terminate" message="tns:Employment_Terminate_InputMessage"/>
<wsdl:output wsam:Action="https://services.ird.govt.nz/GWS/Employment/v2/Employment/TerminateResponse" message="tns:Employment_Terminate_OutputMessage"/>
</wsdl:operation>
<wsdl:operation name="Update">
<wsdl:documentation>
<summary>For use of the Update operation please reference the Employment directory provided at https://github.com/InlandRevenue/Gateway-Services/</summary>
<returns>UpdateResponse will contain a status and error message. See schema for more details.</returns>
<param name="UpdateRequestMsg">UpdateRequest allows the updating of an employment. See Employment schema for more details.</param>
</wsdl:documentation>
<wsdl:input wsam:Action="https://services.ird.govt.nz/GWS/Employment/v2/Employment/Update" message="tns:Employment_Update_InputMessage"/>
<wsdl:output wsam:Action="https://services.ird.govt.nz/GWS/Employment/v2/Employment/UpdateResponse" message="tns:Employment_Update_OutputMessage"/>
</wsdl:operation>
<wsdl:operation name="RetrieveList">
<wsdl:documentation>
<summary>For use of the RetrieveList operation please reference the Employment directory provided at https://github.com/InlandRevenue/Gateway-Services/</summary>
<returns>RetrieveListResponse will have a repeating list of employees. See schema for more details.</returns>
<param name="RetrieveListRequestMsg">RetrieveListRequest will contain employer identifying fields in XML format. See Employment schema for more details.</param>
</wsdl:documentation>
<wsdl:input wsam:Action="https://services.ird.govt.nz/GWS/Employment/v2/Employment/RetrieveList" message="tns:Employment_RetrieveList_InputMessage"/>
<wsdl:output wsam:Action="https://services.ird.govt.nz/GWS/Employment/v2/Employment/RetrieveListResponse" message="tns:Employment_RetrieveList_OutputMessage"/>
</wsdl:operation>
</wsdl:portType>
<wsdl:binding name="WSHttpBinding_Employment" type="tns:Employment">
<wsp:PolicyReference URI="#WSHttpBinding_Employment_policy"/>
<soap12:binding transport="http://schemas.xmlsoap.org/soap/http"/>
<wsdl:operation name="Create">
<soap12:operation soapAction="https://services.ird.govt.nz/GWS/Employment/v2/Employment/Create" style="document"/>
<wsdl:input>
<soap12:body use="literal"/>
</wsdl:input>
<wsdl:output>
<soap12:body use="literal"/>
</wsdl:output>
</wsdl:operation>
<wsdl:operation name="Terminate">
<soap12:operation soapAction="https://services.ird.govt.nz/GWS/Employment/v2/Employment/Terminate" style="document"/>
<wsdl:input>
<soap12:body use="literal"/>
</wsdl:input>
<wsdl:output>
<soap12:body use="literal"/>
</wsdl:output>
</wsdl:operation>
<wsdl:operation name="Update">
<soap12:operation soapAction="https://services.ird.govt.nz/GWS/Employment/v2/Employment/Update" style="document"/>
<wsdl:input>
<soap12:body use="literal"/>
</wsdl:input>
<wsdl:output>
<soap12:body use="literal"/>
</wsdl:output>
</wsdl:operation>
<wsdl:operation name="RetrieveList">
<soap12:operation soapAction="https://services.ird.govt.nz/GWS/Employment/v2/Employment/RetrieveList" style="document"/>
<wsdl:input>
<soap12:body use="literal"/>
</wsdl:input>
<wsdl:output>
<soap12:body use="literal"/>
</wsdl:output>
</wsdl:operation>
</wsdl:binding>
<wsdl:service name="Employment">
<wsdl:port name="WSHttpBinding_Employment" binding="tns:WSHttpBinding_Employment">
<soap12:address location="https://services.ird.govt.nz:4046/gateway/gws/Employment/v2/"/>
<wsa10:EndpointReference>
<wsa10:Address>https://services.ird.govt.nz:4046/gateway/gws/Employment/v2/</wsa10:Address>
</wsa10:EndpointReference>
</wsdl:port>
</wsdl:service>
</wsdl:definitions>