Service - Payday Filing/Employee Details/sample messages/body-employment-update-request.xml

<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope"
               xmlns:emp="https://services.ird.govt.nz/GWS/Employment/v2/"
               xmlns:upd="https://services.ird.govt.nz/GWS/Employment/v2/:types/UpdateRequest"
               xmlns:emp1="urn:www.ird.govt.nz/GWS:types/Employment.v2"
               xmlns:com="urn:www.ird.govt.nz/GWS:types/Common.v2">
    <soap:Header xmlns:wsa="http://www.w3.org/2005/08/addressing">
        <wsa:Action>https://services.ird.govt.nz/GWS/Employment/v2/Employment/Update</wsa:Action>
    </soap:Header>
    <soap:Body>
        <emp:Update>
            <emp:UpdateRequestMsg>
                <upd:UpdateRequestWrapper>
                    <emp1:updateRequest>
                        <emp1:header>
                            <com:softwareProviderData>
                                <com:softwareProvider>SoftwareProvider</com:softwareProvider>
                                <com:softwarePlatform>SoftwarePlatform</com:softwarePlatform>
                                <com:softwareRelease>1.0</com:softwareRelease>
                            </com:softwareProviderData>
                            <com:identifier IdentifierValueType="ACCIRD">123456789</com:identifier>
                            <com:accountType>PSO</com:accountType>
                        </emp1:header>
                        <emp1:employeeIdentifier>
                            <emp1:employeeIRD>123456789</emp1:employeeIRD>
                            <emp1:employeeNameOnEILine>MyNameIsEmployee</emp1:employeeNameOnEILine>
                        </emp1:employeeIdentifier>
                        <emp1:updateBody>
                            <emp1:employeeIRD>123456789</emp1:employeeIRD>
                            <emp1:employeeName>
                                <!--Optional:-->
                                <emp1:nameTitle>title</emp1:nameTitle>
                                <emp1:nameFirst>firstName</emp1:nameFirst>
                                <!--Optional:-->
                                <emp1:nameSurname>surname</emp1:nameSurname>
                                <!--Optional:-->
                                <emp1:nameMiddle>middleName</emp1:nameMiddle>
                            </emp1:employeeName>
                            <emp1:employeeNameOnEILine>MyNameIsEmployee</emp1:employeeNameOnEILine>
                            <emp1:employmentStartDate>2015-07-31</emp1:employmentStartDate>
                            <!--Optional:-->
                            <emp1:employeeDateOfBirth>1990-07-28</emp1:employeeDateOfBirth>
                            <emp1:taxCodes>
                                <!--1 to 4 repetitions:-->
                                <emp1:taxCode>M</emp1:taxCode>
                            </emp1:taxCodes>
                            <!--Optional:-->
                            <emp1:employeeAddress>
                                <com:nzPostAddress>
                                    <com:streetAddress>
                                        <com:streetNumber>12</com:streetNumber>
                                        <com:streetName>Super</com:streetName>
                                    </com:streetAddress>
                                    <!--Optional:-->
                                    <com:unit>
                                        <com:type>Unit</com:type>
                                        <com:number>10</com:number>
                                    </com:unit>
                                    <com:townCity>Woburn</com:townCity>
                                    <com:postCode>5011</com:postCode>
                                    <com:country>NZL</com:country>
                                </com:nzPostAddress>
                            </emp1:employeeAddress>
                            <!--Optional:-->
                            <emp1:employeeEmailAddress>a@b.com</emp1:employeeEmailAddress>
                            <!--Optional:-->
                            <emp1:employeeMobilePhoneNumber>
                                <com:phoneType>CELL</com:phoneType>
                                <com:country>064</com:country>
                                <com:areaCode>21</com:areaCode>
                                <com:number>12345678</com:number>
                                <!--Optional:-->
                                <com:extension>221</com:extension>
                            </emp1:employeeMobilePhoneNumber>
                            <!--Optional:-->
                            <emp1:employeeDayPhoneNumber>
                                <com:phoneType>CELL</com:phoneType>
                                <com:country>064</com:country>
                                <com:areaCode>21</com:areaCode>
                                <com:number>12345678</com:number>
                                <!--Optional:-->
                                <com:extension>222</com:extension>
                            </emp1:employeeDayPhoneNumber>
                            <!--Optional:-->
                            <emp1:employeeKiwiSaverEligibility>EE</emp1:employeeKiwiSaverEligibility>
                            <!--Optional:-->
                            <emp1:optedOut>false</emp1:optedOut>
                            <emp1:validRelationship>true</emp1:validRelationship>
                        </emp1:updateBody>
                    </emp1:updateRequest>
                </upd:UpdateRequestWrapper>
            </emp:UpdateRequestMsg>
        </emp:Update>
    </soap:Body>
</soap:Envelope>